Revit 2027 API
ConduitSize.InnerDiameter Property
 Inner diameter
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double InnerDiameter { get; }
Public ReadOnly Property InnerDiameter As Double
	Get
public:
property double InnerDiameter {
	double get ();
}
member InnerDiameter : float with get
Property Value
Double
See Also
Reference
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace